**Pandas library is used to analyze data.**

*It provides numerous ways to retrieve and read in data.*
==we can convert data from csv, dictionaries, and Databases into dataframe.==

All the data representation is done using two datastructures:
1. Series
2. Dataframe

- *Series in pandas is a one-dimensional ndarray with an axis label. It means that in functionality, it is almost similar to a simple array.*

- Dataframe is the most important and useful data structure, which is used for almost all kind of data representation and manipulation in pandas. *Unlike numpy arrays (in general) a dataframe can contain heterogeneous data. Typically tabular data is represented using dataframes, which is analogous to an Excel sheet or a SQL table.*



- Heterogeneous data structures are data structures that contain diverse types of data, such as integers, doubles, and floats.

In [29]:
import pandas as pd

#  pd.DataFrame() reads data in form of dict, csv or db and converts it into known relational format.
data = [{'city': 'Bangalore', 'data': 5000},
        {'city': 'Delhi', 'data': 2000},
        {'city': 'mumbai', 'data': 5601}]
pd.DataFrame(data)

        city  data
0  Bangalore  5000
1      Delhi  2000
2     mumbai  5601

pd.read_csv() reads the csv file from the specified location and makes a df out of it.

In [30]:
city_data = pd.read_csv("C:\\Users\\Vasu\\Documents\\Notebooks\\Jupyter Notebooks\\Data\\simplemaps_worldcities_basicv1.76\\worldcities.csv")
city_data.head(10)

,city,city_ascii,lat,lng,country,iso2,iso3,admin_name,capital,population,id
0,Tokyo,Tokyo,35.6897,139.6922,Japan,JP,JPN,Tōkyō,primary,37732000.0,1392685764
1,Jakarta,Jakarta,-6.1750,106.8275,Indonesia,ID,IDN,Jakarta,primary,33756000.0,1360771077
2,Delhi,Delhi,28.6100,77.2300,India,IN,IND,Delhi,admin,32226000.0,1356872604
3,Guangzhou,Guangzhou,23.1300,113.2600,China,CN,CHN,Guangdong,admin,26940000.0,1156237133
4,Mumbai,Mumbai,19.0761,72.8775,India,IN,IND,Mahārāshtra,admin,24973000.0,1356226629
5,Manila,Manila,14.5958,120.9772,Philippines,PH,PHL,Manila,primary,24922000.0,1608618140
6,Shanghai,Shanghai,31.1667,121.4667,China,CN,CHN,Shanghai,admin,24073000.0,1156073548
7,São Paulo,Sao Paulo,-23.5500,-46.6333,Brazil,BR,BRA,São Paulo,admin,23086000.0,1076532519
8,Seoul,Seoul,37.5600,126.9900,South Korea,KR,KOR,Seoul,primary,23016000.0,1410836482
9,Mexico City,Mexico City,19.4333,-99.1333,Mexico,MX,MEX,Ciudad de México,primary,21804000.0,1484247881

To connect to databases:

server = 'xxxxxxxx' # Address of the database server
user = 'xxxxxx' # the username for the database server
password = 'xxxxx' # Password for the above user
database = 'xxxxx' # Database in which the table is present
conn = pymssql.connect(server=server, user=user, password=password, database=database)
query = "select * from some_table"
df = pd.read_sql(query, conn)

In [31]:
city_data.tail(10)

,city,city_ascii,lat,lng,country,iso2,iso3,admin_name,capital,population,id
44681,Starorybnoye,Starorybnoye,72.7666,104.8000,Russia,RU,RUS,Krasnoyarskiy Kray,NaN,10.0,1643724242
44682,Sagastyr,Sagastyr,73.3779,126.5924,Russia,RU,RUS,Sakha (Yakutiya),NaN,10.0,1643535665
44683,Zemlya Bunge,Zemlya Bunge,74.8983,142.1050,Russia,RU,RUS,Sakha (Yakutiya),NaN,10.0,1643720805
44684,Agapa,Agapa,71.4504,89.2500,Russia,RU,RUS,Krasnoyarskiy Kray,NaN,10.0,1643009087
44685,Tukchi,Tukchi,57.3670,139.5000,Russia,RU,RUS,Khabarovskiy Kray,NaN,10.0,1643472801
44686,Numto,Numto,63.6667,71.3333,Russia,RU,RUS,Khanty-Mansiyskiy Avtonomnyy Okrug-Yugra,NaN,10.0,1643985006
44687,Nord,Nord,81.7166,-17.8000,Greenland,GL,GRL,NaN,NaN,10.0,1304217709
44688,Timmiarmiut,Timmiarmiut,62.5333,-42.2167,Greenland,GL,GRL,Kujalleq,NaN,10.0,1304206491
44689,San Rafael,San Rafael,-16.7795,-60.6799,Bolivia,BO,BOL,Santa Cruz,NaN,NaN,1068405265
44690,Nordvik,Nordvik,74.0165,111.5100,Russia,RU,RUS,Krasnoyarskiy Kray,NaN,0.0,1643587468

Data Access

In [32]:
series_es = city_data.lat     # lat is the column name in the city_data dataframe.
series_es[1:10:2]             # slicing from 1 to 10 skipping every second entry.

1    -6.1750
3    23.1300
5    14.5958
7   -23.5500
9    19.4333
Name: lat, dtype: float64

Slicing in Pandas series can help to access desired values.

In [33]:
series_es[:7]       # first 7 data items.
series_es[:-7315]   # excluding last 7315 items.items

0        35.6897
1        -6.1750
2        28.6100
3        23.1300
4        19.0761
          ...
37371    53.4302
37372    26.2336
37373    53.2000
37374    50.9667
37375    43.9115
Name: lat, Length: 37376, dtype: float64

Slicing in DataFrames.

- dataframe[:n] refers to [0, n) rows
- dataframe[n:] refers to [n, end) rows / all the rows from n to last.

* TO get to specific row and column we use .iloc[] *

In [34]:
city_data[:7]  # first 7 rows

,city,city_ascii,lat,lng,country,iso2,iso3,admin_name,capital,population,id
0,Tokyo,Tokyo,35.6897,139.6922,Japan,JP,JPN,Tōkyō,primary,37732000.0,1392685764
1,Jakarta,Jakarta,-6.1750,106.8275,Indonesia,ID,IDN,Jakarta,primary,33756000.0,1360771077
2,Delhi,Delhi,28.6100,77.2300,India,IN,IND,Delhi,admin,32226000.0,1356872604
3,Guangzhou,Guangzhou,23.1300,113.2600,China,CN,CHN,Guangdong,admin,26940000.0,1156237133
4,Mumbai,Mumbai,19.0761,72.8775,India,IN,IND,Mahārāshtra,admin,24973000.0,1356226629
5,Manila,Manila,14.5958,120.9772,Philippines,PH,PHL,Manila,primary,24922000.0,1608618140
6,Shanghai,Shanghai,31.1667,121.4667,China,CN,CHN,Shanghai,admin,24073000.0,1156073548

In [35]:
city_data.iloc[:5, :3]

        city city_ascii      lat
0      Tokyo      Tokyo  35.6897
1    Jakarta    Jakarta  -6.1750
2      Delhi      Delhi  28.6100
3  Guangzhou  Guangzhou  23.1300
4     Mumbai     Mumbai  19.0761

from 5-10 rows, give city, country and their iso3.
here, I have created an array of attributes and passed as an argument where .loc's column are passed.

In [39]:
city_data.loc[5:10, ['city', 'country', 'iso3']]

           city      country iso3
5        Manila  Philippines  PHL
6      Shanghai        China  CHN
7     São Paulo       Brazil  BRA
8         Seoul  South Korea  KOR
9   Mexico City       Mexico  MEX
10        Cairo        Egypt  EGY

In [38]:
city_data.loc[5:10, 'city':'country']   # 5 se 10 tak row traversal and city se country tak column traversal.

           city   city_ascii      lat       lng      country
5        Manila       Manila  14.5958  120.9772  Philippines
6      Shanghai     Shanghai  31.1667  121.4667        China
7     São Paulo    Sao Paulo -23.5500  -46.6333       Brazil
8         Seoul        Seoul  37.5600  126.9900  South Korea
9   Mexico City  Mexico City  19.4333  -99.1333       Mexico
10        Cairo        Cairo  30.0444   31.2358        Egypt

Boolean based indexing.
it allows us to work with a specific set of rows and columns.

In [45]:
# city_data where city_data's population is > 10 million.
city_data_greater_10mil = city_data[city_data['population']>10000000]

# show me city_data > 10m where its population is > 15m
city_data_greater_10mil.where(city_data_greater_10mil.population>15000000)

,city,city_ascii,lat,lng,country,iso2,iso3,admin_name,capital,population,id
0,Tokyo,Tokyo,35.6897,139.6922,Japan,JP,JPN,Tōkyō,primary,37732000.0,1.392686e+09
1,Jakarta,Jakarta,-6.1750,106.8275,Indonesia,ID,IDN,Jakarta,primary,33756000.0,1.360771e+09
2,Delhi,Delhi,28.6100,77.2300,India,IN,IND,Delhi,admin,32226000.0,1.356873e+09
3,Guangzhou,Guangzhou,23.1300,113.2600,China,CN,CHN,Guangdong,admin,26940000.0,1.156237e+09
4,Mumbai,Mumbai,19.0761,72.8775,India,IN,IND,Mahārāshtra,admin,24973000.0,1.356227e+09
5,Manila,Manila,14.5958,120.9772,Philippines,PH,PHL,Manila,primary,24922000.0,1.608618e+09
6,Shanghai,Shanghai,31.1667,121.4667,China,CN,CHN,Shanghai,admin,24073000.0,1.156074e+09
7,São Paulo,Sao Paulo,-23.5500,-46.6333,Brazil,BR,BRA,São Paulo,admin,23086000.0,1.076533e+09
8,Seoul,Seoul,37.5600,126.9900,South Korea,KR,KOR,Seoul,primary,23016000.0,1.410836e+09
9,Mexico City,Mexico City,19.4333,-99.1333,Mexico,MX,MEX,Ciudad de México,primary,21804000.0,1.484248e+09
10,Cairo,Cairo,30.0444,31.2358,Egypt,EG,EGY,Al Qāhirah,primary,20296000.0,1.818254e+09
11,New York,New York,40.6943,-73.9249,United States,US,USA,New York,NaN,18972871.0,1.840034e+09
12,Dhaka,Dhaka,23.7639,90.3889,Bangladesh,BD,BGD,Dhaka,primary,18627000.0,1.050529e+09
13,Beijing,Beijing,39.9040,116.4075,China,CN,CHN,Beijing,primary,18522000.0,1.156229e+09
14,Kolkāta,Kolkata,22.5675,88.3700,India,IN,IND,West Bengal,admin,18502000.0,1.356061e+09
15,Bangkok,Bangkok,13.7525,100.4942,Thailand,TH,THA,Krung Thep Maha Nakhon,primary,18007000.0,1.764069e+09
16,Shenzhen,Shenzhen,22.5350,114.0540,China,CN,CHN,Guangdong,minor,17619000.0,1.156159e+09
17,Moscow,Moscow,55.7558,37.6178,Russia,RU,RUS,Moskva,primary,17332000.0,1.643318e+09
18,Buenos Aires,Buenos Aires,-34.5997,-58.3819,Argentina,AR,ARG,"Buenos Aires, Ciudad Autónoma de",primary,16710000.0,1.032717e+09
19,Lagos,Lagos,6.4550,3.3841,Nigeria,NG,NGA,Lagos,minor,16637000.0,1.566594e+09
20,Istanbul,Istanbul,41.0136,28.9550,Turkey,TR,TUR,İstanbul,admin,16079000.0,1.792756e+09
21,Karachi,Karachi,24.8600,67.0100,Pakistan,PK,PAK,Sindh,admin,15738000.0,1.586129e+09
22,Bangalore,Bangalore,12.9789,77.5917,India,IN,IND,Karnātaka,admin,15386000.0,1.356410e+09
23,Ho Chi Minh City,Ho Chi Minh City,10.7756,106.7019,Vietnam,VN,VNM,Hồ Chí Minh,admin,15136000.0,1.704774e+09
24,Ōsaka,Osaka,34.6939,135.5022,Japan,JP,JPN,Ōsaka,admin,15126000.0,1.392420e+09
25,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
26,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
27,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
28,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
29,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
30,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
31,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
32,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
33,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
34,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
35,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
36,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
37,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
38,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
39,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
40,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
41,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
42,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
43,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

** Data Operations **

In [52]:
import numpy as np
# create a dataframe of [random 2d array of 8 rows, 3 columns where column names are (a, b. c)]
my_dataframe = pd.DataFrame(np.random.randn(8, 3),  columns=['A', 'B', 'C'])

# Values will create numpy ndarray from the dataframe by using *values* attribute.
np_array = my_dataframe.values
type(np_array)

numpy.ndarray

Missing Data and fillna function

In [59]:
# let's first put a NA value in the dataset.
my_dataframe.iloc[3, 2] = None
my_dataframe

          A         B         C
0  0.373341  0.846170 -0.434318
1 -0.321547  0.205293 -1.131174
2  0.993356 -0.605969  0.025298
3  0.352819  1.466505       NaN
4  0.641741 -0.061802 -0.360992
5 -0.591186 -0.378005  1.184616
6 -0.098216 -0.358609  0.212510
7  0.150560 -0.078745  0.436593

In [64]:
# Now, we will use fillna function to fill na/None/null values.
# we will substitute 0 in place of missing values.
my_dataframe.fillna(0, inplace = True) # inplace = true means don't return a new df, just do it there.
my_dataframe

          A         B         C
0  0.373341  0.846170 -0.434318
1 -0.321547  0.205293 -1.131174
2  0.993356 -0.605969  0.025298
3  0.352819  1.466505  0.000000
4  0.641741 -0.061802 -0.360992
5 -0.591186 -0.378005  1.184616
6 -0.098216 -0.358609  0.212510
7  0.150560 -0.078745  0.436593